--[[
<< تم برمجه وكتابه السورس من مطور شيرو >>
<<         @T_1S1_T          >>
]]
function run(msg, matches)
if msg.to.type == 'channel' and redis:get(boss..'group:add'..msg.to.id) then
if matches[1] == "الاوامر" then
if not is_mod(msg) then return "🔅¦ للاداريين فقط 🎖" end
return [[
      ❂

💯┇هـنـاكـ « 4 » اوامـر لـتـعـيـرف عـن الـبـوت 🤖✔️
—---------------------------------------
🚷┇ م1 ~» آوٌآمہر آلآدآرهہ

💭┇م2 -» آوٌآمہر عہدآدآتہ مہجہمہوٌعہهہ🏌🏾‍♂

🛠┇م3 -» آوٌآمہر قہفہل وٌفہتہحہ ⛏

💎┇م4 -» آوٌآمہر آلعہآمہهہ🖇

🛠┇(لعہرضہ آوٌآمہر آلمہطہوٌر (م المطور
                  
             ‌‌‏❋¦ مہطہوٌر آلبہوٌتہ 🚸❗️ { ]]..SUDO_USER..[[ } ✓ ]]
end     
if matches[1]== 'م1' then
if not is_mod(msg) then return "🔅¦ للاداريين فقط 🎖" end
local text =[[
💯   آوٌآمہر آلرفہعہ وٌتہنہزيہل
      
🚷- { رفع ادمن ~ تنزيل ادمن } 
🚷- { رفع عضو مميز ~ تنزيل عضو مميز }
🚷- { رفع المدير ~ تنزيل المدير }
🚷- { رفع منشى ~ تنزيل منشى }
ـ➖➖➖➖➖
      
ـ
  آوٌآمہر آلحہظہر وٌآلطہرد وٌآلتہقہيہد
ـ
      
🚷 - { طرد بالرد او بالمعرف } : لطرد العضو 
🚷 - { حظر بالرد او بالمعرف } : لحظر وطرد العضو 
🚷- { الغاء الحظر } : لالغاء الحظر عن عضو 
🚷- { منع } : لمنع كلمه داخل المجموعه
🚷- { الغاء منع }  : لالغاء منع الكلمه  
🚷- { كتم }  : لكتم العضو بالرد
🚷- { الغاء الكتم }  : لالغاء الكتم بالرد
➖➖➖➖➖ـ

🗯┇آلمہطہوٌر آلبہوٌتہ 💡↭ ]]..SUDO_USER
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م2' then
if not is_mod(msg) then return "🔅¦ للاداريين فقط 🎖" end
local text = [[
👨🏽‍✈️¦  آوٌآمہر وٌضہعہ للمہجہوٌعہهہ

ـ📮┇➖➖➖➖➖

🛠┇ضع الترحيب + الكلمه  :↜ لوضع ترحيب  
🛠┇ضع قوانين :↜ لوضع قوانين 
🛠┇ضع وصف :↜ لوضع وصف  
🛠┇ضـع رابط :↜ لوضع الرابط  
🛠┇الـرابـط :↜  لعرض الرابط  

ـ🔩┇➖➖➖➖➖

👨🏽‍💻¦  آوٌآمہر آلآعہدآدآتہ آلمہجہمہوٌعہهہ::

🛠┇القوانين : لعرض  القوانين 
🛠┇الادمنيه : لعرض  الادمنيه 
🛠┇المدراء : لعرض  الاداريين 
🛠┇المكتومين :↜لعرض  المكتومين 
🛠┇المطور : لعرض معلومات المطور 
🛠┇معلوماتي :↜لعرض معلوماتك  
🛠┇الحمايه : لعرض كل الاعدادات  
🛠┇الوسائط : لعرض اعدادات الميديا 
🛠┇الاعدادات : لعرض اعدادات المجموعه 
🛠┇المجموعه : لعرض معلومات المجموعه 
🛠┇جهاتي : لرؤيه عدد الجهات التي اضفتها

➖➖➖➖➖➖➖
⚠️¦ آلمہطہوٌر آلبہوٌتہ ❗️?↭ ]]..SUDO_USER
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م3' then
if not is_mod(msg) then return "🔅¦ للاداريين فقط 🎖" end
local text = [[
آوٌآمہر حہمہآيہهہ آلمہجہمہوٌعہهہ

📮ـ➖➖➖➖
🔒┇قفل ~ فتح :  التعديل
🔒┇قفل ~ فتح :  البصمات
🔒┇قفل ~ فتح :  الــفيديو
🔒┇قفل ~ فتح الفيديو
🔒┇قفل ~ فتح :  الـصــور 
🔒┇قفل ~ فتح :  الملصقات
🔒┇قفل ~ فتح :  المتحركه
🔒┇قفل ~ فتح : الدردشه
🔒┇قفل ~ فتح : الروابط
🔒┇قفل ~ فتح : التاك
🔒┇قفل ~ فتح : البوتات
🔒┇قفل ~ فتح : المعرفات
🔒┇قفل ~ فتح : البوتات بالطرد
🔒┇قفل ~ فتح : الكلايش
🔒┇قفل ~ فتح : التكرار
🔒┇قفل ~ فتح :  التوجيه
🔒┇قفل ~ فتح :  الانلاين
🔒┇قفل ~ فتح : الجهات 
🔒┇قفل ~ فتح : الــكـــل
📌ـ➖➖➖➖➖
🔐┇تفعيل ~ تعطيل : الترحيب 
🔍┇تفعيل ~ تعطيل : الردود 
🔓┇تفعيل ~ تعطيل : التحذير
🔒┇ تفعيل ~ تعطيل : الايدي
🔅ـ➖➖➖➖➖
🛠┇آلمہطہوٌر آلبہوٌتہ↭ ]]..SUDO_USER
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'م4' then
if not is_mod(msg) then return "🔅¦ للاداريين فقط 🎖" end
local text = [[
📍💭 آوٌآمہر آلعہآمہهہ 

🔅ـ➖➖➖➖➖
🕵🏻┇معلوماتك الشخصيه 
🚸┇اسمي : لعرض اسمك 
〽️┇معرفي : لعرض معرفك 
⚜️┇ايديي : لعرض ايديك 
🔅ـ➖➖➖➖➖
🔅┇اوامر التحشيش 😄
📵┇تحب + (اسم الشخص)
📵┇بوس + (اسم الشخص) 
📵┇كول + (اسم الشخص) 
📵┇كله + الرد + (الكلام) 
🔅ـ➖➖➖➖➖

🛠┇آلمہطہوٌر آلبہوٌتہ↭ ]]..SUDO_USER
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== "م المطور" then
if not is_sudo(msg) then return "🔅¦ للمطوين فقط 🎖" end
local text = [[
📌┇ آوٌآمہر آلمہطہوٌر 🃏

🛠┇تفعيل : لتفعيل البوت 
🛠┇تعطيل : لتعطيل البوت 
🛠┇اسم بوتك + غادر : لطرد البوت
🛠┇مسح الادمنيه : لمسح الادمنيه 
🛠┇مسح المميزين : لمسح الاعضاء المميزين 
🛠┇مسح المدراء : لمسح المدراء 
🛠┇مسح المطورين : لمسح كل المطورين
🛠┇تحديث: لتحديث ملفات البوت

🛠┇اذاعه : لنشر كلمه لكل المجموعات
🛠┇اذاعه خاص : لنشر كلمه لكل المشتركين خاص
🛠┇اذاعه عام : لنشر كلمه لكل المجموعات والخاص
🛠┇اذاعه عام بالتوجيه : لمشر منشور قناتك بابتوجيه للكل

 🛠┇تحديث السورس: لتحديث السورس الى اصدار احدث
🔅ـ➖➖➖➖➖

🛠┇آلمہطہوٌر آلبہوٌتہ↭ ]]..SUDO_USER
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== 'وامر الردود' then
if not is_owner(msg) then return "🔅¦هہآذهہ آلآمہر للمہدرآء 🎖" end
local text = [[
🚸┇آوٌآمہر آلردوٌد
🔅ـ➖➖➖➖➖
🔰┇الردود : لعرض الردود المثبته
🔰┇اضف رد : لأضافه رد جديد
🔰┇مسح رد  الرد المراد مسحه
🔰┇مسح الردود : لمسح كل الردود
🔰┇اضف رد عام : لاضافه رد لكل المجموعات
🔰┇مسح رد عام : لمسح الرد العام 
🔰┇مسح الردود العامه : لمسح كل ردود العامه
ـ➖➖➖➖➖
🛠┇آلمہطہوٌر آلبہوٌتہ↭ ]]..SUDO_USER
return sendMsg(msg.to.id,1,text,'md')
end
if matches[1]== "اوامر الملفات" then
if not we_sudo(msg) then return "هہذآ آلآمہر للمہطہوٌر آسہآسہيہ🚷" end
local text = [[آوٌآمہر آلمہلفہآتہ🔰

⚖️┇/p  لعرض قائمه الملفات السورس 
⚖️┇/p + اسم الملف المراد تفعيله 
⚖️┇/p - اسم الملف المراد تعطيله 
⚖️┇sp + الاسم | لارسال الملف اليك 
⚖️┇dp + اسم الملف المراد حذفه 
⚖️┇sp all | لارسالك كل ملفات السورس
]]
return sendMsg(msg.to.id,1,text,'md')
end end 
if matches[1] == "سورس" or matches[1]=="السورس" then
return [[
    🛠 ┇ تنصـيب سـورس بيبوو آلجديد 🔎

 ⇓⇓⇓ 

sudo apt-get update && sudo apt-get upgrade -y && sudo apt-get autoremove && sudo apt-get autoclean && sudo apt-get install libreadline-dev libconfig-dev libssl-dev lua5.2 liblua5.2-dev libevent-dev make unzip git redis-server g++ libjansson-dev libpython-dev expat libexpat1-dev -y && cd $HOME && rm -rf BEBO3 && rm -rf .telegram-cli && git clone https://github.com/BEBO3/BEBO3.git && cd BEBO3 && ./launch.sh install && ./launch.sh

» تنصيب بكود واحد 👆
» اضغط ع كود سيتم نسخ بسهولهہ
» اي استفسار او مساعده راسل المطورين
» المطور ارسلان @iiij5

💭┇المطور السورس شيرو @T_1S1_T


    ]]
end end
return{patterns = {"^(السورس)$","^(سورس)$","^(م المطور)$", "^(اوامر الرد)$", "^(اوامر الملفات)$", "^(الاوامر)$", "^(م1)$", "^(م2)$", "^(م3)$", "^(م4)$", }, run = run,}
